In [12]:
import pandas as pd

df = pd.read_csv('./Data/Universitas.csv').dropna().drop(columns='Program Studi')
df

                       Nama_PT        Kota
0       Universitas Hasanuddin    Makassar
1       Universitas Hasanuddin    Makassar
2       Universitas Hasanuddin    Makassar
5        Universitas Indonesia       Depok
6        Universitas Indonesia       Depok
7       Universitas Gajah Mada  Yogyakarta
9   Institut Teknologi Bandung     Bandung
10  Institut Teknologi Bandung     Bandung

In [13]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
df['Encoded'] = le.fit_transform(df['Kota'])

In [14]:
le.classes_

array(['Bandung', 'Depok', 'Makassar', 'Yogyakarta'], dtype=object)

In [15]:
df

                       Nama_PT        Kota  Encoded
0       Universitas Hasanuddin    Makassar        2
1       Universitas Hasanuddin    Makassar        2
2       Universitas Hasanuddin    Makassar        2
5        Universitas Indonesia       Depok        1
6        Universitas Indonesia       Depok        1
7       Universitas Gajah Mada  Yogyakarta        3
9   Institut Teknologi Bandung     Bandung        0
10  Institut Teknologi Bandung     Bandung        0